char 				-128 .. 127
signed char			-128 .. 127
unsigned char	   	   0 .. 255
--------------------------------------------------------------------------------
unsigned short 	   	   0 .. 65 535
signed short 	 -32 768 .. 32 767
float //(floating-плавать) - работает с дробными числами, также его называют тип с плавающей точкой.


Общая таблица для любого типа
---------------------------------------------------------------------------------
1. У каждого типа есть нижняя граница.
2. У каждого типа есть верхняя граница.
3. У каждого типа есть модификатор (алиас /alias).
	3.1 Signed - со знаком (знак -, можем использовать отрицательные числа.)
	3.2 Unsigned - без знака (только положительные числа, включая ноль.)